wishlist/test-load.yaml
config:
  target: "http://localhost:8004"
  phases:
    - duration: 60  # Selama 1 menit
      arrivalRate: 10  # 10 request per detik (normal load)
    - duration: 30
      arrivalRate: 50  # 50 request per detik (peak load)
    - duration: 60
      arrivalRate: 5  # 5 request per detik (low load)
scenarios:
  - flow:
      - get:
          url: "/api/wishlist/eb963cd2-2dca-4794-9929-5dcbf5fb0021"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6ImY4ZjNiNjIwLThkZTItNGEzMi05NjgyLTliMDBjZWZiMjg5MiIsInRlbmFudF9pZCI6IjQ3ZGQ2YjI0LTBiMjMtNDZiMC1hNjYyLTc3NjE1OGQwODliYSIsImlhdCI6MTc0MTMyMDU3MywiZXhwIjoxNzQxNDA2OTczfQ.c6t8-_NHvN25xESvAjpBvzrbqtD-yHWJ_sSWSO4NS7Y"